---
kind: property
id: P:Autodesk.Revit.DB.Connector.Id
zh: 连接件、接口
source: html/18b69396-f73a-72d5-9ce9-fd1a172907d0.htm
---
# Autodesk.Revit.DB.Connector.Id Property

**中文**: 连接件、接口

A unique identifier to identify this connector.

## Syntax (C#)
```csharp
public int Id { get; }
```